In [1]:
from src import analisis_soporte as ans
import pandas as pd
import numpy as np



import matplotlib.pyplot as plt
import seaborn as sns


from scipy import stats
from scipy.stats import ttest_ind, norm, chi2_contingency, f_oneway
from sklearn.linear_model import LinearRegression


# Gestión de los warnings
# -----------------------------------------------------------------------
import warnings
warnings.filterwarnings("ignore")

In [2]:
df = pd.read_csv('fligh-data-clean.csv', index_col=0)

In [3]:
df_booked = df[df['flights booked'] > 0]

In [4]:
df_test = df_booked[['loyalty number', 'flights booked', 'education']]
df_test

        loyalty number  flights booked education
0               100018               3  bachelor
1               100102              10   college
2               100140               6   college
8               100428               6  bachelor
10              100550               3  bachelor
...                ...             ...       ...
405612          999550              15    doctor
405613          999589              14   college
405614          999631              11  bachelor
405616          999758               1   college
405621          999940               3  bachelor

[207624 rows x 3 columns]

In [5]:
tabla_stats = df_test.groupby('education')['flights booked'].agg(['mean','mean','std','var'])
tabla_stats

                          mean      mean       std        var
education
bachelor              8.028607  8.028607  4.669000  21.799564
college               8.070523  8.070523  4.667465  21.785233
doctor                8.053519  8.053519  4.697898  22.070242
high school or below  8.016147  8.016147  4.681404  21.915543
master                8.005894  8.005894  4.620198  21.346227

In [6]:
ans.normalidad(df, 'flights booked')

Para la columna flights booked los datos no siguen una distribución normal.

In [7]:
ans.normalidad(df_booked, 'flights booked')

Para la columna flights booked los datos no siguen una distribución normal.

## Hipótesis:

- H0: No existen diferencias significativas entre los grupos de nivel educativo
- H1: Existen ciertas diferencias significativas entre los grupos de nivel educativo